; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-3-8-9)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	s13 - location
	p0-9 - location
	p0-10 - location
	p1-5 - location
	p1-13 - location
	p3-0 - location
	p3-12 - location
	p4-7 - location
	p6-4 - location
	p7-1 - location
	p7-5 - location
	p8-1 - location
	p8-3 - location
	p9-2 - location
	p9-8 - location
	p10-0 - location
	p10-1 - location
	p10-6 - location
	p10-11 - location
	p11-4 - location
	p11-8 - location
	p12-6 - location
	p12-7 - location
	p12-9 - location
	p13-4 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s2)
	(at driver3 s6)
	(at truck1 s6)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s13)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s1)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s8)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s12)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s10)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at truck7 s3)
	(empty truck7)
	(= (load truck7) 0)
	(= (fuel-per-minute truck7) 10)
	(at truck8 s12)
	(empty truck8)
	(= (load truck8) 0)
	(= (fuel-per-minute truck8) 10)
	(at package1 s0)
	(at package2 s7)
	(at package3 s3)
	(at package4 s4)
	(at package5 s4)
	(at package6 s2)
	(at package7 s7)
	(at package8 s5)
	(at package9 s6)
	(path s0 p0-9)
	(path p0-9 s0)
	(path s9 p0-9)
	(path p0-9 s9)
	(path s0 p0-10)
	(path p0-10 s0)
	(path s10 p0-10)
	(path p0-10 s10)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(path s1 p1-13)
	(path p1-13 s1)
	(path s13 p1-13)
	(path p1-13 s13)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-12)
	(path p3-12 s3)
	(path s12 p3-12)
	(path p3-12 s12)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s6 p6-4)
	(path p6-4 s6)
	(path s4 p6-4)
	(path p6-4 s4)
	(path s7 p7-1)
	(path p7-1 s7)
	(path s1 p7-1)
	(path p7-1 s1)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s9 p9-2)
	(path p9-2 s9)
	(path s2 p9-2)
	(path p9-2 s2)
	(path s9 p9-8)
	(path p9-8 s9)
	(path s8 p9-8)
	(path p9-8 s8)
	(path s10 p10-1)
	(path p10-1 s10)
	(path s1 p10-1)
	(path p10-1 s1)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(path s10 p10-11)
	(path p10-11 s10)
	(path s11 p10-11)
	(path p10-11 s11)
	(path s11 p11-4)
	(path p11-4 s11)
	(path s4 p11-4)
	(path p11-4 s4)
	(path s11 p11-8)
	(path p11-8 s11)
	(path s8 p11-8)
	(path p11-8 s8)
	(path s12 p12-6)
	(path p12-6 s12)
	(path s6 p12-6)
	(path p12-6 s6)
	(path s12 p12-7)
	(path p12-7 s12)
	(path s7 p12-7)
	(path p12-7 s7)
	(path s12 p12-9)
	(path p12-9 s12)
	(path s9 p12-9)
	(path p12-9 s9)
	(path s13 p13-4)
	(path p13-4 s13)
	(path s4 p13-4)
	(path p13-4 s4)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 14)
	(= (time-to-drive s1 s0) 14)
	(link s0 s8)
	(link s8 s0)
	(= (time-to-drive s0 s8) 99)
	(= (time-to-drive s8 s0) 99)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 46)
	(= (time-to-drive s11 s0) 46)
	(link s0 s12)
	(link s12 s0)
	(= (time-to-drive s0 s12) 67)
	(= (time-to-drive s12 s0) 67)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 68)
	(= (time-to-drive s2 s1) 68)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 51)
	(= (time-to-drive s4 s1) 51)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 5)
	(= (time-to-drive s7 s1) 5)
	(link s1 s8)
	(link s8 s1)
	(= (time-to-drive s1 s8) 87)
	(= (time-to-drive s8 s1) 87)
	(link s1 s13)
	(link s13 s1)
	(= (time-to-drive s1 s13) 62)
	(= (time-to-drive s13 s1) 62)
	(link s2 s6)
	(link s6 s2)
	(= (time-to-drive s2 s6) 79)
	(= (time-to-drive s6 s2) 79)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 48)
	(= (time-to-drive s10 s2) 48)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 57)
	(= (time-to-drive s5 s3) 57)
	(link s3 s10)
	(link s10 s3)
	(= (time-to-drive s3 s10) 41)
	(= (time-to-drive s10 s3) 41)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 55)
	(= (time-to-drive s2 s4) 55)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 61)
	(= (time-to-drive s7 s4) 61)
	(link s4 s10)
	(link s10 s4)
	(= (time-to-drive s4 s10) 15)
	(= (time-to-drive s10 s4) 15)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 36)
	(= (time-to-drive s1 s6) 36)
	(link s6 s7)
	(link s7 s6)
	(= (time-to-drive s6 s7) 62)
	(= (time-to-drive s7 s6) 62)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 42)
	(= (time-to-drive s10 s6) 42)
	(link s6 s13)
	(link s13 s6)
	(= (time-to-drive s6 s13) 40)
	(= (time-to-drive s13 s6) 40)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 65)
	(= (time-to-drive s11 s7) 65)
	(link s7 s12)
	(link s12 s7)
	(= (time-to-drive s7 s12) 80)
	(= (time-to-drive s12 s7) 80)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 26)
	(= (time-to-drive s3 s8) 26)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 22)
	(= (time-to-drive s10 s8) 22)
	(link s8 s13)
	(link s13 s8)
	(= (time-to-drive s8 s13) 39)
	(= (time-to-drive s13 s8) 39)
	(link s9 s0)
	(link s0 s9)
	(= (time-to-drive s9 s0) 19)
	(= (time-to-drive s0 s9) 19)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 59)
	(= (time-to-drive s2 s9) 59)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 72)
	(= (time-to-drive s7 s9) 72)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 34)
	(= (time-to-drive s8 s9) 34)
	(link s9 s11)
	(link s11 s9)
	(= (time-to-drive s9 s11) 11)
	(= (time-to-drive s11 s9) 11)
	(link s10 s0)
	(link s0 s10)
	(= (time-to-drive s10 s0) 31)
	(= (time-to-drive s0 s10) 31)
	(link s10 s13)
	(link s13 s10)
	(= (time-to-drive s10 s13) 47)
	(= (time-to-drive s13 s10) 47)
	(link s11 s2)
	(link s2 s11)
	(= (time-to-drive s11 s2) 10)
	(= (time-to-drive s2 s11) 10)
	(link s12 s2)
	(link s2 s12)
	(= (time-to-drive s12 s2) 76)
	(= (time-to-drive s2 s12) 76)
	(link s12 s8)
	(link s8 s12)
	(= (time-to-drive s12 s8) 14)
	(= (time-to-drive s8 s12) 14)
	(link s13 s2)
	(link s2 s13)
	(= (time-to-drive s13 s2) 77)
	(= (time-to-drive s2 s13) 77)
	(link s13 s7)
	(link s7 s13)
	(= (time-to-drive s13 s7) 27)
	(= (time-to-drive s7 s13) 27)
	(link s13 s9)
	(link s9 s13)
	(= (time-to-drive s13 s9) 18)
	(= (time-to-drive s9 s13) 18)
	(link s13 s11)
	(link s11 s13)
	(= (time-to-drive s13 s11) 63)
	(= (time-to-drive s11 s13) 63)
	(link s13 s12)
	(link s12 s13)
	(= (time-to-drive s13 s12) 88)
	(= (time-to-drive s12 s13) 88)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s1)
	(at driver3 s9)
	(at truck2 s8)
	(at truck3 s11)
	(at truck5 s7)
	(at truck8 s5)
	(at package1 s8)
	(at package2 s1)
	(at package3 s7)
	(at package4 s7)
	(at package5 s8)
	(at package6 s2)
	(at package7 s0)
	(at package8 s11)
	(at package9 s1)
	))

(:metric minimize (+ (* 4 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver3 truck1 s6)
   deleted: (at driver3 s6) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 1 of 15
2. (drive-truck truck1 s6 s1 driver3)
   deleted: (at truck1 s6)
   added: (at truck1 s1)
   changed: (fuel-used) from 0 to 360
   goals met: 1 of 15
3. (drive-truck truck1 s1 s0 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 360 to 500
   goals met: 1 of 15
4. (load-truck package1 truck1 s0)
   deleted: (at package1 s0)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 15
5. (drive-truck truck1 s0 s1 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 500 to 654
   goals met: 1 of 15
6. (drive-truck truck1 s1 s7 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s7)
   changed: (fuel-used) from 654 to 709
   goals met: 1 of 15
7. (load-truck package2 truck1 s7)
   deleted: (at package2 s7)
   added: (in package2 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 1 of 15
8. (drive-truck truck1 s7 s1 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s1)
   changed: (fuel-used) from 709 to 774
   goals met: 1 of 15
9. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 2 of 15
10. (drive-truck truck1 s1 s8 driver3)
   deleted: (at truck1 s1)
   added: (at truck1 s8)
   changed: (fuel-used) from 774 to 1731
   goals met: 2 of 15
11. (unload-truck package1 truck1 s8)
   deleted: (in package1 truck1)
   added: (at package1 s8)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 3 of 15
12. (drive-truck truck1 s8 s12 driver3)
   deleted: (at truck1 s8)
   added: (at truck1 s12)
   changed: (fuel-used) from 1731 to 1871
   goals met: 3 of 15
13. (disembark-truck driver3 truck1 s12)
   deleted: (driving driver3 truck1)
   added: (at driver3 s12) (empty truck1)
   goals met: 3 of 15
14. (board-truck driver3 truck8 s12)
   deleted: (at driver3 s12) (empty truck8)
   added: (driving driver3 truck8)
   goals met: 3 of 15
15. (drive-truck truck8 s12 s2 driver3)
   deleted: (at truck8 s12)
   added: (at truck8 s2)
   changed: (fuel-used) from 1871 to 2631
   goals met: 3 of 15
16. (drive-truck truck8 s2 s6 driver3)
   deleted: (at truck8 s2)
   added: (at truck8 s6)
   changed: (fuel-used) from 2631 to 3421
   goals met: 3 of 15
17. (load-truck package9 truck8 s6)
   deleted: (at package9 s6)
   added: (in package9 truck8)
   changed: (load truck8) from 0 to 1, (fuel-per-minute truck8) from 10 to 11
   goals met: 3 of 15
18. (drive-truck truck8 s6 s7 driver3)
   deleted: (at truck8 s6)
   added: (at truck8 s7)
   changed: (fuel-used) from 3421 to 4103
   goals met: 3 of 15
19. (load-truck package7 truck8 s7)
   deleted: (at package7 s7)
   added: (in package7 truck8)
   changed: (load truck8) from 1 to 2, (fuel-per-minute truck8) from 11 to 13
   goals met: 3 of 15
20. (drive-truck truck8 s7 s1 driver3)
   deleted: (at truck8 s7)
   added: (at truck8 s1)
   changed: (fuel-used) from 4103 to 4168
   goals met: 3 of 15
21. (unload-truck package9 truck8 s1)
   deleted: (in package9 truck8)
   added: (at package9 s1)
   changed: (load truck8) from 2 to 1, (fuel-per-minute truck8) from 13 to 11
   goals met: 4 of 15
22. (drive-truck truck8 s1 s0 driver3)
   deleted: (at truck8 s1)
   added: (at truck8 s0)
   changed: (fuel-used) from 4168 to 4322
   goals met: 4 of 15
23. (unload-truck package7 truck8 s0)
   deleted: (in package7 truck8)
   added: (at package7 s0)
   changed: (load truck8) from 1 to 0, (fuel-per-minute truck8) from 11 to 10
   goals met: 5 of 15
24. (drive-truck truck8 s0 s1 driver3)
   deleted: (at truck8 s0)
   added: (at truck8 s1)
   changed: (fuel-used) from 4322 to 4462
   goals met: 5 of 15
25. (drive-truck truck8 s1 s4 driver3)
   deleted: (at truck8 s1)
   added: (at truck8 s4)
   changed: (fuel-used) from 4462 to 4972
   goals met: 5 of 15
26. (load-truck package4 truck8 s4)
   deleted: (at package4 s4)
   added: (in package4 truck8)
   changed: (load truck8) from 0 to 1, (fuel-per-minute truck8) from 10 to 11
   goals met: 5 of 15
27. (drive-truck truck8 s4 s7 driver3)
   deleted: (at truck8 s4)
   added: (at truck8 s7)
   changed: (fuel-used) from 4972 to 5643
   goals met: 5 of 15
28. (unload-truck package4 truck8 s7)
   deleted: (in package4 truck8)
   added: (at package4 s7)
   changed: (load truck8) from 1 to 0, (fuel-per-minute truck8) from 11 to 10
   goals met: 6 of 15
29. (drive-truck truck8 s7 s4 driver3)
   deleted: (at truck8 s7)
   added: (at truck8 s4)
   changed: (fuel-used) from 5643 to 6253
   goals met: 6 of 15
30. (load-truck package5 truck8 s4)
   deleted: (at package5 s4)
   added: (in package5 truck8)
   changed: (load truck8) from 0 to 1, (fuel-per-minute truck8) from 10 to 11
   goals met: 6 of 15
31. (drive-truck truck8 s4 s1 driver3)
   deleted: (at truck8 s4)
   added: (at truck8 s1)
   changed: (fuel-used) from 6253 to 6814
   goals met: 6 of 15
32. (drive-truck truck8 s1 s8 driver3)
   deleted: (at truck8 s1)
   added: (at truck8 s8)
   changed: (fuel-used) from 6814 to 7771
   goals met: 6 of 15
33. (walk driver2 s2 p9-2)
   deleted: (at driver2 s2)
   added: (at driver2 p9-2)
   goals met: 6 of 15
34. (unload-truck package5 truck8 s8)
   deleted: (in package5 truck8)
   added: (at package5 s8)
   changed: (load truck8) from 1 to 0, (fuel-per-minute truck8) from 11 to 10
   goals met: 7 of 15
35. (walk driver2 p9-2 s9)
   deleted: (at driver2 p9-2)
   added: (at driver2 s9)
   goals met: 7 of 15
36. (walk driver2 s9 p12-9)
   deleted: (at driver2 s9)
   added: (at driver2 p12-9)
   goals met: 7 of 15
37. (walk driver2 p12-9 s12)
   deleted: (at driver2 p12-9)
   added: (at driver2 s12)
   goals met: 7 of 15
38. (board-truck driver2 truck5 s12)
   deleted: (at driver2 s12) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 7 of 15
39. (drive-truck truck5 s12 s7 driver2)
   deleted: (at truck5 s12)
   added: (at truck5 s7)
   changed: (fuel-used) from 7771 to 8571
   goals met: 8 of 15
40. (drive-truck truck8 s8 s9 driver3)
   deleted: (at truck8 s8)
   added: (at truck8 s9)
   changed: (fuel-used) from 8571 to 8911
   goals met: 8 of 15
41. (drive-truck truck5 s7 s1 driver2)
   deleted: (at truck5 s7)
   added: (at truck5 s1)
   changed: (fuel-used) from 8911 to 8961
   goals met: 7 of 15
42. (disembark-truck driver2 truck5 s1)
   deleted: (driving driver2 truck5)
   added: (at driver2 s1) (empty truck5)
   goals met: 8 of 15
43. (drive-truck truck8 s9 s8 driver3)
   deleted: (at truck8 s9)
   added: (at truck8 s8)
   changed: (fuel-used) from 8961 to 9301
   goals met: 8 of 15
44. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 7 of 15
45. (drive-truck truck8 s8 s3 driver3)
   deleted: (at truck8 s8)
   added: (at truck8 s3)
   changed: (fuel-used) from 9301 to 9561
   goals met: 7 of 15
46. (drive-truck truck3 s1 s7 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (fuel-used) from 9561 to 9611
   goals met: 7 of 15
47. (load-truck package3 truck8 s3)
   deleted: (at package3 s3)
   added: (in package3 truck8)
   changed: (load truck8) from 0 to 1, (fuel-per-minute truck8) from 10 to 11
   goals met: 7 of 15
48. (drive-truck truck8 s3 s8 driver3)
   deleted: (at truck8 s3)
   added: (at truck8 s8)
   changed: (fuel-used) from 9611 to 9897
   goals met: 7 of 15
49. (drive-truck truck8 s8 s9 driver3)
   deleted: (at truck8 s8)
   added: (at truck8 s9)
   changed: (fuel-used) from 9897 to 10271
   goals met: 7 of 15
50. (drive-truck truck3 s7 s13 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s13)
   changed: (fuel-used) from 10271 to 10541
   goals met: 7 of 15
51. (disembark-truck driver2 truck3 s13)
   deleted: (driving driver2 truck3)
   added: (at driver2 s13) (empty truck3)
   goals met: 7 of 15
52. (board-truck driver2 truck2 s13)
   deleted: (at driver2 s13) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 15
53. (drive-truck truck8 s9 s8 driver3)
   deleted: (at truck8 s9)
   added: (at truck8 s8)
   changed: (fuel-used) from 10541 to 10915
   goals met: 7 of 15
54. (drive-truck truck2 s13 s1 driver2)
   deleted: (at truck2 s13)
   added: (at truck2 s1)
   changed: (fuel-used) from 10915 to 11535
   goals met: 7 of 15
55. (unload-truck package3 truck8 s8)
   deleted: (in package3 truck8)
   added: (at package3 s8)
   changed: (load truck8) from 1 to 0, (fuel-per-minute truck8) from 11 to 10
   goals met: 7 of 15
56. (drive-truck truck8 s8 s9 driver3)
   deleted: (at truck8 s8)
   added: (at truck8 s9)
   changed: (fuel-used) from 11535 to 11875
   goals met: 7 of 15
57. (disembark-truck driver2 truck2 s1)
   deleted: (driving driver2 truck2)
   added: (at driver2 s1) (empty truck2)
   goals met: 8 of 15
58. (walk driver2 s1 p1-13)
   deleted: (at driver2 s1)
   added: (at driver2 p1-13)
   goals met: 7 of 15
59. (walk driver2 p1-13 s13)
   deleted: (at driver2 p1-13)
   added: (at driver2 s13)
   goals met: 7 of 15
60. (board-truck driver2 truck3 s13)
   deleted: (at driver2 s13) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 7 of 15
61. (drive-truck truck3 s13 s1 driver2)
   deleted: (at truck3 s13)
   added: (at truck3 s1)
   changed: (fuel-used) from 11875 to 12495
   goals met: 7 of 15
62. (drive-truck truck3 s1 s8 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s8)
   changed: (fuel-used) from 12495 to 13365
   goals met: 7 of 15
63. (load-truck package3 truck3 s8)
   deleted: (at package3 s8)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 7 of 15
64. (drive-truck truck3 s8 s1 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s1)
   changed: (fuel-used) from 13365 to 14322
   goals met: 7 of 15
65. (drive-truck truck3 s1 s7 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (fuel-used) from 14322 to 14377
   goals met: 7 of 15
66. (unload-truck package3 truck3 s7)
   deleted: (in package3 truck3)
   added: (at package3 s7)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 8 of 15
67. (drive-truck truck8 s9 s8 driver3)
   deleted: (at truck8 s9)
   added: (at truck8 s8)
   changed: (fuel-used) from 14377 to 14717
   goals met: 8 of 15
68. (drive-truck truck8 s8 s3 driver3)
   deleted: (at truck8 s8)
   added: (at truck8 s3)
   changed: (fuel-used) from 14717 to 14977
   goals met: 8 of 15
69. (drive-truck truck8 s3 s5 driver3)
   deleted: (at truck8 s3)
   added: (at truck8 s5)
   changed: (fuel-used) from 14977 to 15547
   goals met: 9 of 15
70. (load-truck package8 truck8 s5)
   deleted: (at package8 s5)
   added: (in package8 truck8)
   changed: (load truck8) from 0 to 1, (fuel-per-minute truck8) from 10 to 11
   goals met: 9 of 15
71. (drive-truck truck8 s5 s3 driver3)
   deleted: (at truck8 s5)
   added: (at truck8 s3)
   changed: (fuel-used) from 15547 to 16174
   goals met: 8 of 15
72. (drive-truck truck8 s3 s8 driver3)
   deleted: (at truck8 s3)
   added: (at truck8 s8)
   changed: (fuel-used) from 16174 to 16460
   goals met: 8 of 15
73. (drive-truck truck8 s8 s9 driver3)
   deleted: (at truck8 s8)
   added: (at truck8 s9)
   changed: (fuel-used) from 16460 to 16834
   goals met: 8 of 15
74. (drive-truck truck8 s9 s11 driver3)
   deleted: (at truck8 s9)
   added: (at truck8 s11)
   changed: (fuel-used) from 16834 to 16955
   goals met: 8 of 15
75. (unload-truck package8 truck8 s11)
   deleted: (in package8 truck8)
   added: (at package8 s11)
   changed: (load truck8) from 1 to 0, (fuel-per-minute truck8) from 11 to 10
   goals met: 9 of 15
76. (drive-truck truck8 s11 s9 driver3)
   deleted: (at truck8 s11)
   added: (at truck8 s9)
   changed: (fuel-used) from 16955 to 17065
   goals met: 9 of 15
77. (drive-truck truck8 s9 s8 driver3)
   deleted: (at truck8 s9)
   added: (at truck8 s8)
   changed: (fuel-used) from 17065 to 17405
   goals met: 9 of 15
78. (drive-truck truck8 s8 s3 driver3)
   deleted: (at truck8 s8)
   added: (at truck8 s3)
   changed: (fuel-used) from 17405 to 17665
   goals met: 9 of 15
79. (drive-truck truck8 s3 s5 driver3)
   deleted: (at truck8 s3)
   added: (at truck8 s5)
   changed: (fuel-used) from 17665 to 18235
   goals met: 10 of 15
80. (drive-truck truck3 s7 s11 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s11)
   changed: (fuel-used) from 18235 to 18885
   goals met: 11 of 15
81. (disembark-truck driver3 truck8 s5)
   deleted: (driving driver3 truck8)
   added: (at driver3 s5) (empty truck8)
   goals met: 11 of 15
82. (walk driver3 s5 p1-5)
   deleted: (at driver3 s5)
   added: (at driver3 p1-5)
   goals met: 11 of 15
83. (walk driver3 p1-5 s1)
   deleted: (at driver3 p1-5)
   added: (at driver3 s1)
   goals met: 11 of 15
84. (board-truck driver3 truck2 s1)
   deleted: (at driver3 s1) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 11 of 15
85. (drive-truck truck2 s1 s8 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s8)
   changed: (fuel-used) from 18885 to 19755
   goals met: 12 of 15
86. (drive-truck truck3 s11 s13 driver2)
   deleted: (at truck3 s11)
   added: (at truck3 s13)
   changed: (fuel-used) from 19755 to 20385
   goals met: 11 of 15
87. (drive-truck truck3 s13 s1 driver2)
   deleted: (at truck3 s13)
   added: (at truck3 s1)
   changed: (fuel-used) from 20385 to 21005
   goals met: 11 of 15
88. (disembark-truck driver2 truck3 s1)
   deleted: (driving driver2 truck3)
   added: (at driver2 s1) (empty truck3)
   goals met: 12 of 15
89. (board-truck driver2 truck5 s1)
   deleted: (at driver2 s1) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 11 of 15
90. (drive-truck truck2 s8 s1 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   changed: (fuel-used) from 21005 to 21875
   goals met: 10 of 15
91. (disembark-truck driver2 truck5 s1)
   deleted: (driving driver2 truck5)
   added: (at driver2 s1) (empty truck5)
   goals met: 11 of 15
92. (board-truck driver2 truck3 s1)
   deleted: (at driver2 s1) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 10 of 15
93. (drive-truck truck3 s1 s7 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s7)
   changed: (fuel-used) from 21875 to 21925
   goals met: 10 of 15
94. (disembark-truck driver2 truck3 s7)
   deleted: (driving driver2 truck3)
   added: (at driver2 s7) (empty truck3)
   goals met: 10 of 15
95. (drive-truck truck2 s1 s8 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s8)
   changed: (fuel-used) from 21925 to 22795
   goals met: 11 of 15
96. (walk driver2 s7 p7-1)
   deleted: (at driver2 s7)
   added: (at driver2 p7-1)
   goals met: 11 of 15
97. (walk driver2 p7-1 s1)
   deleted: (at driver2 p7-1)
   added: (at driver2 s1)
   goals met: 12 of 15
98. (board-truck driver2 truck5 s1)
   deleted: (at driver2 s1) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 11 of 15
99. (drive-truck truck5 s1 s7 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s7)
   changed: (fuel-used) from 22795 to 22845
   goals met: 12 of 15
100. (disembark-truck driver2 truck5 s7)
   deleted: (driving driver2 truck5)
   added: (at driver2 s7) (empty truck5)
   goals met: 12 of 15
101. (board-truck driver2 truck3 s7)
   deleted: (at driver2 s7) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 12 of 15
102. (drive-truck truck3 s7 s11 driver2)
   deleted: (at truck3 s7)
   added: (at truck3 s11)
   changed: (fuel-used) from 22845 to 23495
   goals met: 13 of 15
103. (drive-truck truck2 s8 s9 driver3)
   deleted: (at truck2 s8)
   added: (at truck2 s9)
   changed: (fuel-used) from 23495 to 23835
   goals met: 12 of 15
104. (disembark-truck driver2 truck3 s11)
   deleted: (driving driver2 truck3)
   added: (at driver2 s11) (empty truck3)
   goals met: 12 of 15
105. (drive-truck truck2 s9 s8 driver3)
   deleted: (at truck2 s9)
   added: (at truck2 s8)
   changed: (fuel-used) from 23835 to 24175
   goals met: 13 of 15
106. (walk driver2 s11 p10-11)
   deleted: (at driver2 s11)
   added: (at driver2 p10-11)
   goals met: 13 of 15
107. (disembark-truck driver3 truck2 s8)
   deleted: (driving driver3 truck2)
   added: (at driver3 s8) (empty truck2)
   goals met: 13 of 15
108. (walk driver3 s8 p9-8)
   deleted: (at driver3 s8)
   added: (at driver3 p9-8)
   goals met: 13 of 15
109. (walk driver3 p9-8 s9)
   deleted: (at driver3 p9-8)
   added: (at driver3 s9)
   goals met: 14 of 15
110. (walk driver2 p10-11 s10)
   deleted: (at driver2 p10-11)
   added: (at driver2 s10)
   goals met: 14 of 15
111. (walk driver2 s10 p10-1)
   deleted: (at driver2 s10)
   added: (at driver2 p10-1)
   goals met: 14 of 15
112. (walk driver2 p10-1 s1)
   deleted: (at driver2 p10-1)
   added: (at driver2 s1)
   goals met: 15 of 15
